Repository: common-repository/wc-iikocloud
Catalog: languages/wc-iikocloud-*.po
Languages: ru_ru

source: Access token was removed successfully
ru_ru: Токен доступа успешно удален

source: Error while access token removing
ru_ru: Ошибка при удалении токена доступа

source: Organizations
ru_ru: Организации

source: Response does not contain organizations
ru_ru: Ответ не содержит организаций

source: Organization
ru_ru: Организация

source: Error while adding organization ID in plugin settings. Organization ID
ru_ru: Ошибка при добавлении ID организации в настройках плагина. ID организации

source: Error while adding organization name in plugin settings. No organization selected
ru_ru: Ошибка при добавлении названия организации в настройках плагина. Не выбрана организация

source: Cannot save import organization ID in plugin settings
ru_ru: Невозможно сохранить ID организации импорта в настройках плагина

source: Cannot save organization name in plugin settings
ru_ru: Невозможно сохранить название организации в настройках плагина

source: Organization saved successfully
ru_ru: Организация успешно сохранена

source: Organization ID
ru_ru: ID организации

source: Terminals
ru_ru: Терминалы

source: Organization does not have terminals
ru_ru: Организация не содержит терминалы

source: No terminal IDs
ru_ru: Нет ID идентификаторов

source: Terminal
ru_ru: Терминал

source: Terminal IDs
ru_ru: ID терминалов

source: Cannot save export organization ID in plugin settings
ru_ru: Невозможно сохранить ID экспортируемой организации в настройках плагина

source: Cannot save terminals in plugin settings
ru_ru: Невозможно сохранить терминалы в настройках плагина

source: Organization and terminals saved successfully
ru_ru: Организация и терминалы успешно сохранены

source: Nomenclature
ru_ru: Номенклатура

source: Menus
ru_ru: Меню

source: Response does not contain menus
ru_ru: Ответ не содержит меню

source: Menu
ru_ru: Меню

source: External menu ID
ru_ru: ID внешнего меню

source: Cities
ru_ru: Города

source: No city IDs
ru_ru: Нет ID городов

source: City
ru_ru: Город

source: Streets
ru_ru: Улицы

source: No group IDs
ru_ru: Нет ID групп

source: Group
ru_ru: Группа

source: Group IDs
ru_ru: ID групп

source: Error while import chosen groups. No groups selected
ru_ru: Ошибка при импорте выбранных групп. Группы не выбраны

source: Error while saving chosen groups in plugin settings. No groups selected
ru_ru: Ошибка при сохранении выбранных групп в настройках плагина. Группы не выбраны

source: Cannot save chosen groups in plugin settings
ru_ru: Невозможно сохранить выбранные группы в настройках плагина

source: Error while saving menu ID in plugin settings. No menu ID selected
ru_ru: Ошибка при сохранении ID меню в настройках плагина. Меню не выбрано

source: Cannot save menu ID in plugin settings
ru_ru: Невозможно сохранить ID меню в настройках плагина

source: Groups saved successfully
ru_ru: Группы успешно сохранены

source: Cannot add streets for the city %s to the plugin options.
ru_ru: Невозможно добавить улицы города %s в параметры плагина

source: Cannot add streets amount for the city %s to the plugin options.
ru_ru: Невозможно добавить количество улиц для города %s в настройки плагина

source: Cannot add chosen cities IDs to the plugin options
ru_ru: Невозможно добавить ID выбранных городов в настройки плагина

source: Cannot add default city ID to the plugin options
ru_ru: Невозможно добавить идентификатор города по умолчанию в настроки плагина

source: Cannot add cities to the plugin options
ru_ru: Невозможно добавить города в настройки плагина

source: Response does not contain cities
ru_ru: Ответ не содержит городов

source: City
ru_ru: Город

source: iiko API-key is not set. Check the API-key in plugin settings
ru_ru: API-ключ iiko не установлен. Проверьте API-ключ в настройках плагина

source: Token request failed. Check the API-key in plugin settings
ru_ru: Не удалось выполнить запрос токена. Проверьте API-ключ в настройках плагина

source: Response does not contain token
ru_ru: Ответ не содержит токен

source: Cannot set access token transient
ru_ru: Невозможно установить трансиент токена доступа

source: Terminals are empty
ru_ru: Терминалы пусты

source: Order is empty
ru_ru: Заказ пуст

source: Iiko export error. Order %s
ru_ru: Ошибка экспорта в iiko. Заказ %s

source: Check %sWooCommerce logs%s on your website.
ru_ru: Проверьте %sлоги WooCommerce%s на вашем сайте

source: %s Check WooCommerce logs on your website.
ru_ru: %s Проверьте логи WooCommerce на вашем сайте.

source: Order
ru_ru: Заказ

source: Error while caching iiko nomenclature
ru_ru: Ошибка при кэшировании номенклатуры iiko

source: There are not dish groups
ru_ru: Нет групп блюд

source: There are not products
ru_ru: Нет блюд

source: Cannot add iiko product categories to the plugin options
ru_ru: Невозможно добавить категории товаров iiko в настройки плагина

source: Cannot add nomenclature revision to the plugin options
ru_ru: Невозможно добавить версию номенклатуры в настройки плагина

source: Error while caching iiko external menu nomenclature
ru_ru: Ошибка при кэшировании номенклатуры внешнего меню iiko

source: Organization does not have nomenclature groups
ru_ru: Организация не имеет номенклатурных групп

source: The external menu does not have categories
ru_ru: Внешнее меню не имеет категорий

source: ORGANIZATIONS
ru_ru: ОРГАНИЗАЦИИ

source: Chose organization
ru_ru: Выберите организацию

source: TERMINALS
ru_ru: ТЕРМИНАЛЫ

source: Chose terminals
ru_ru: Выберите терминал

source: EXTERNAL MENUS
ru_ru: ВНЕШНИЕ МЕНЮ

source: Chose menu
ru_ru: Выберите меню

source: Chose groups
ru_ru: Выберите группы

source: GROUPS
ru_ru: ГРУППЫ

source: DISHES
ru_ru: БЛЮДА

source: GOODS
ru_ru: ТОВАРЫ

source: SERVICES
ru_ru: УСЛУГИ

source: MODIFIERS
ru_ru: МОДИФИКАТОРЫ

source: SIZES
ru_ru: РАЗМЕРЫ

source: CATEGORIES
ru_ru: КАТЕГОРИИ

source: CITIES
ru_ru: ГОРОДА

source: Chose cities
ru_ru: Выберите города

source: Settings
ru_ru: Настройки

source: General
ru_ru: Главное

# Tab name
source: Import
ru_ru: Импорт

source: Export
ru_ru: Экспорт

source: Logs
ru_ru: Логи

source: Get Premium
ru_ru: Улучшить до Премиум

source: Control
ru_ru: Управление

source: Documentation
ru_ru: Документация

source: Support
ru_ru: Поддержка

source: Heads up, Please backup before upgrade!
ru_ru: Внимание, сделайте резервную копию перед обновлением!

source: The latest update includes some substantial changes across different areas of the plugin. We highly recommend you %1$sbackup your site before upgrading%2$s, and make sure you first update in a staging environment.
ru_ru: Последнее обновление включает в себя некоторые существенные изменения в различных областях плагина. Мы настоятельно рекомендуем %1$sсделать резервную копию%2$s вашего сайта перед обновлением и для начала попробовать обновить на тестовом сайте.

source: %1$s error: the %2$s version %3$s or higher needs to be installed. The ionCube Loader is the industry standard PHP extension for running protected PHP code, and can usually be added easily to a PHP installation. For Loaders please visit %4$s and for an instructional video please see %5$s
ru_ru: Ошибка %1$s: необходимо установить %2$s версии %3$s или выше. Загрузчик ionCube — это стандартное PHP-расширение для запуска защищенного PHP-кода, которое обычно можно легко добавить в установку PHP. Для информации о погрузчиках посетите %4$s, а также посмотрите обучающее видео — %5$s.

source: %1$s requires %2$s to be installed and activated.
ru_ru: %1$s требует установки и активации %2$s.

source: %1$s requires %2$s version %3$s or greater.
ru_ru: %1$s требует %2$s версии %3$s или более поздней.

source: iiko group ID
ru_ru: iiko ID группы

source: Uniqe iiko group ID for the product category.
ru_ru: Уникальный ID группы iiko для категории товаров.

source: Uniqe iiko product ID.
ru_ru: Уникальный ID товара iiko.

source: iiko product category ID
ru_ru: ID категории продукта iiko

source: Energy value
ru_ru: Энергетическая ценность

source: Proteins
ru_ru: Белки

source: Fats
ru_ru: Жиры

source: Carbohydrates
ru_ru: Углеводы

source: KBZHU (per 100g)
ru_ru: КБЖУ (на 100 гр.)

source: KBZHU (per item)
ru_ru: КБЖУ (на блюдо)

source: Export order to iiko
ru_ru: Экспорт заказа в iiko

source: Check created delivery from iiko
ru_ru: Проверить созданную доставку в iiko

source: Get general information
ru_ru: Получить основную информацию

source: Organizations, terminals, categories and products from iiko.
ru_ru: Организации, терминалы, категории и товары из iiko.

# Get
source: Organizations
ru_ru: организации

# Save
source: Organization for Import
ru_ru: организацию для импорта

# Get
source: Terminals
ru_ru: терминалы

# Save
source: Organization and Terminal for Export
ru_ru: организацию и терминал для экспорта

source: Get nomenclature (menu)
ru_ru: Получить номенклатуру (меню)

source: External menus
ru_ru: Внешние меню

source: New method.
ru_ru: Новый метод.

# Get
source: Menus
ru_ru: меню

source: Price categories
ru_ru: Ценовые категории

# Get
source: Menu nomenclature
ru_ru: номенклатуру меню

source: Menu from iikoOffice
ru_ru: Меню из iikoOffice

source: Previous method.
ru_ru: Предыдущий метод.

# Get
source: Nomenclature
ru_ru: номенклатуру

source: You can change the import method in the %splugin settings%s.
ru_ru: Вы можете изменить метод импорта в %sнастройках плагина%s

source: Import
ru_ru: Импорт

source: Categories and products to WooCommerce.
ru_ru: Категорий и товаров в WooCommerce.

source: Groups
ru_ru: Группы

source: %sStrikethrough%s items are deleted groups.
ru_ru: %sЗачёркнутые%s элементы - это удаленные группы.

# Save
source: selected groups for auto import
ru_ru: выбранные группы для автоимпорта

# Get
source: products of selected groups
ru_ru: товары выбранных групп

source: Get additional information
ru_ru: Получить дополнительную информацию

source: Cities, streets and payment methods from iiko to prepare the export of orders from WooCommerce to iiko.
ru_ru: Города, улицы и способы оплаты из iiko для подготовки экспорта заказов из WooCommerce в iiko.

# Get
source: Cities
ru_ru: города

# Get
source: Streets
ru_ru: улицы

source: And save chosen city and streets to the plugin options.
ru_ru: И сохранить выбранный город и улицы в настройки.

source: Terminal:
ru_ru: Терминал:

source: Remove access token
ru_ru: Удалить токен доступа

source: Clear
ru_ru: Очистить

source: Auto import
ru_ru: Автоимпорт

source: Payments
ru_ru: Методы оплаты

source: Webhooks
ru_ru: Вебхуки

source: Loyalty
ru_ru: Лояльность

source: Delivery Zones
ru_ru: Зоны доставки

source: Checkout
ru_ru: Оформление заказа

source: Terminal #%s
ru_ru: Терминал №%s

source: Terminal #%s ID - %s%s%s
ru_ru: ID терминала №%s - %s%s%s

source: Updated automatically when you press 'Get Nomenclature' button.
ru_ru: Обновляется автоматически при нажатии кнопки 'Получить номенклатуру'.

source: (PREMIUM FEATURE)
ru_ru: (ПРЕМИУМ ФУНКЦИЯ)

source: Some of these settings are updated automatically on %splugin the page%s.
ru_ru: Некоторые из этих настроек обновляются автоматически на %sстранице плагина%s.

source: Premium options
ru_ru: Премиум опции

source: Import method
ru_ru: Метод импорта

source: Unloading from iikoOffice
ru_ru: Выгрузка из iikoOffice

source: External menu
ru_ru: Внешнее меню

source: Organization for import
ru_ru: Организация для импорта

source: Organization ID - %s%s%s
ru_ru: ID организации - %s%s%s

source: Updated automatically when you press 'Save Organization for Import' button.
ru_ru: Обновляется автоматически при нажатии кнопки 'Сохранить организацию для импорта'.

source: Nomenclature revision
ru_ru: Ревизия номенклатуры

source: Update stop list
ru_ru: Обновлять стоп-лист

source: Update products by iiko stop list after import
ru_ru: Обновление товаров по стоп-листу iiko после импорта

source: This option is useful when you use stop lists.
ru_ru: Этот параметр полезен при использовании стоп-листов.

source: Import product into multiple categories
ru_ru: Импортировать товары в несколько категорий

source: Each product can be contained in several categories
ru_ru: Каждый товар может содержаться в нескольких категориях

source: Async import
ru_ru: Асинхронный импорт

source: Import products in the background
ru_ru: Импортировать товары в фоновом режиме

source: Reverse groups import
ru_ru: Обратный импорт групп

source: Import groups in the reverse order
ru_ru: Импортировать группы в обратном порядке

source: Import only simple products
ru_ru: Импортировать только простые товары

source: Import all iiko products as simple WooCommerce products
ru_ru: Импортировать все продукты iiko как простые товары WooCommerce

source: Modifiers
ru_ru: Модификаторы

source: Skip unrequired modifiers
ru_ru: Пропустить необязательные модификаторы

source: Do not import unrequired group modifiers
ru_ru: Не импортировать необязательные групповые модификаторы

source: Skip these group modifiers
ru_ru: Не импортировать эти групповые модификаторы

source: Separate group modifier names with a pipe character - |
ru_ru: Разделите имена групповых модификаторов с помощью вертикальной черты - |

source: Import group modifiers as product custom fields
ru_ru: Импортировать групповые модификаторы как произвольные поля товаров

source: Do not import group modifiers as product variations
ru_ru: Не импортировать групповые модификаторы как вариации товаров

source: Show modifiers description
ru_ru: Показать описание модификаторов

source: To import
ru_ru: Импортировать

source: Images
ru_ru: Изображения

source: Import products and categories images from iiko
ru_ru: Импортировать изображения товаров и категорий из iiko

source: Descriptions
ru_ru: Описания

source: Import products and categories descriptions from iiko
ru_ru: Импортировать описания товаров и категорий из iiko

source: Tags
ru_ru: Метки

source: Import products tags from iiko
ru_ru: Импортировать метки (теги) товаров из iiko

source: SEO
ru_ru: СЕО

source: Import products and categories SEO titles and descriptions from iiko (works only with Yoast SEO plugin)
ru_ru: Импортировать SEO-заголовки и описания товаров и категорий из iiko (работает только с плагином Yoast SEO)

source: Sale prices
ru_ru: Цены со скидкой

source: Import sale prices from iiko
ru_ru: Импортировать цены со скидками из iiko

source: Enable reviews
ru_ru: Включить отзывы

source: When importing products
ru_ru: При импорте товаров

source: Hide all old products
ru_ru: Скрыть все старые товары

source: Set status %sOut of stock%s for all products that are not in the current iiko stock list
ru_ru: Установить статус %sНет в наличии%s для всех товаров, которых нет в текущей выгрузке номенклатуры iiko

source: Delete old products
ru_ru: Удалить старые товары

source: Leave %sonly products from selected groups%s. The rest of the items will be removed into Trash
ru_ru: Оставить %sтолько товары из выбранных групп%s. Остальные элементы будут удалены в корзину

source: Delete attributes and variations
ru_ru: Удаление атрибуты и вариации

source: Delete all attributes and variations for variable WooCommerce products
ru_ru: Удалить все атрибуты и вариации для вариативных товаров WooCommerce

source: Variations limit
ru_ru: Лимит вариаций

source: Limit the number of created variations.
ru_ru: Ограничить количество создаваемых вариаций.

source: Default limit is 50 variation. Use 0 in order to create all possible variations.
ru_ru: По умолчанию ограничение составляет 50 вариаций. Для создания всех возможных вариаций используйте 0.

source: Delete old product photos
ru_ru: Удалить старые изображения товаров

source: Delete %sALL old photos%s for each product
ru_ru: Удалить %sВСЕ старые изображения%s для каждого товара

source: Delete old product categories photos
ru_ru: Удалить старые изображения категорий товаров

source: Delete %sold photo%s for each product category
ru_ru: Удалить %sстарое изображение%s для каждой категории товаров

source: Export orders
ru_ru: Экспорт заказов

source: Export orders instead of deliveries.
ru_ru: Экспортировать заказы вместо доставок.

source: Deliveries
ru_ru: Доставки

source: Orders for the kitchen
ru_ru: Заказы на кухню

source: Deliveries and Orders for the kitchen
ru_ru: Доставки и заказы на кухню

source: Turn off export
ru_ru: Отключить экспорт

source: Check orders after they are exported
ru_ru: Проверять заказы после экспорта

source: Close orders after they are exported
ru_ru: Закрывать заказы после экспорта

source: Only for exporting kitchen orders.
ru_ru: Только для экспорта заказов на кухню.

source: Whether paper cheque should be printed
ru_ru: Нужно ли печатать бумажный чек

source: Check online payment method
ru_ru: Проверить метод онлайн оплаты

source: Use payment method slug.
ru_ru: Используйте код метода оплаты.

source: Organization for export
ru_ru: Организация для экспорта

source: Updated when you press 'Save Organization and Terminals for Export' button.
ru_ru: Обновляется при нажатии кнопки "Сохранить организацию и терминалы для экспорта".

source: Default city
ru_ru: Город по умолчанию

source: This list contains the cities that you last imported and that will be used on the checkout page.
ru_ru: Этот список содержит города, которые вы импортировали в последний раз и которые будут использоваться на странице оформления заказа.

source: Updated automatically when you press 'Get Streets' button.
ru_ru: Обновляется автоматически при нажатии кнопки 'Получить улицы'.

source: Default iiko street ID
ru_ru: ID улицы iiko по-умолчанию

source: This street will be used, if a customer chooses his own street during a checkout process.
ru_ru: Эта улица будет использоваться, если покупатель выберет свою улицу в процессе оформления заказа.

source: To export
ru_ru: Экспортировать

source: Prices
ru_ru: Цены

source: Export product prices to iiko (sale prices if they are or regular prices instead)
ru_ru: Экспортировать цены товаров в iiko (цены со скидкой, если они есть, или обычные цены)

source: Shipping as product ID
ru_ru: ID товара для доставки

source: Move shipping costs to a separate product.
ru_ru: Переместить стоимость доставки в отдельный товар.

source: The ID of the product to transfer the shipping cost.
ru_ru: ID товара для стоимости доставки.

source: IikoCloud Settings
ru_ru: Настройки iikoCloud

source: API-key
ru_ru: АПИ-ключ

source: Unique identifier of the store, issued by the iiko. %sSee documentation%s or contact your personal manager for more details.
ru_ru: Уникальный идентификатор магазина, выданный iiko. %sПодробнее в документации%s или у вашего персонального менеджера iiko.

source: If the API-key field is empty, then the plugin will not work.
ru_ru: Если поле АПИ-ключ пусто, то плагин работать не будет.

source: Timeout in seconds
ru_ru: Таймаут в секундах

source: Time limit for API requests.
ru_ru: Лимит времени для запросов API.

source: Default iikoCloud API value is 15 second.
ru_ru: Значение по-умолчанию iikoCloud API - 15 секунд.

source: API Server
ru_ru: API сервер

source: Use European iiko API Server
ru_ru: Использовать европейский сервер API iiko

source: If unchecked the Russian iiko API server will be used.
ru_ru: Если не отмечено флажком, будет использоваться российский сервер API iiko.

source: Debug
ru_ru: Отладка

source: Debug mode
ru_ru: Режим отладки

source: Turn on debug mode
ru_ru: Включить режим отладки

source: See logs in %sWooCommerce > System Status > Logs%s.
ru_ru: Смотрите логи в %sWooCommerce > Статус > Журналы%s.

source: Email for errors
ru_ru: Email для ошибок

source: Comma-separated list of email addresses to send error messages
ru_ru: Список адресов электронной почты, разделенных запятыми, для отправки сообщений об ошибках

source: If this field is empty, the site administrator's email will be used.
ru_ru: Если это поле пустое, будет использоваться email администратора сайта.

source: Telegram bot token
ru_ru: Токен бота Telegram

source: See this %sinstruction%s to get it.
ru_ru: Смотрите эту %sинструкцию%s, чтобы получить его.

source: If this field is empty, messages to Telegram won't be sent.
ru_ru: Если это поле пустое, то сообщения в Телеграм отправляться не будут.

source: Telegram bot user name
ru_ru: Имя пользователя бота Telegram

source: Telegram chat ID
ru_ru: ID чата Telegram

source: Use the URL %shttps://api.telegram.org/bot<YourBOTToken>/getUpdates%s to get it.
ru_ru: Используйте URL %shttps://api.telegram.org/bot<YourBOTToken>/getUpdates%s чтобы получить его.

source: Localization
ru_ru: Локализация

source: Locale
ru_ru: Локаль

source: Default value is %s.
ru_ru: Значение по-умолчанию %s.

source: Time zone
ru_ru: Часовой пояс

source: Opening hour
ru_ru: Час закрытия

source: Opening time of the establishment. Possible values: 1 - 24
ru_ru: Время открытия заведения. Возможные значения: 1 - 24

source: Closing hour
ru_ru: Час закрытия

source: Closing time of the establishment. Possible values: 1 - 24
ru_ru: Время закрытия заведения. Возможные значения: 1 - 24

source: Other
ru_ru: Другое

source: Plugin Uninstallation
ru_ru: Удаление плагина

source: Remove settings after plugin uninstallation
ru_ru: Удалить настройки после удаления плагина

source: Iiko delivery creation error. Order %s
ru_ru: Ошибка создания доставки iiko. Заказ %s

source: iiko creation status is %s. ID: %s
ru_ru: Статус создания в iiko - %s. ID: %s

source: Order #%s has payment method: %s
ru_ru: В заказе №%s указан способ оплаты: %s

source: New order #%s.
ru_ru: Новый заказ №%s.

source: Order #%s does not have iiko ID
ru_ru: У заказа №%s нет идентификатора iiko

# Button
source: Back to the orders list
ru_ru: Вернуться к списку заказов

source: E
ru_ru: К

source: P
ru_ru: Б

source: F
ru_ru: Ж

source: C
ru_ru: У

source: per 100 g
ru_ru: на 100 гр.

source: per item
ru_ru: на блюдо

source: kcal
ru_ru: ккал.

source: g
ru_ru: гр.

source: API request resource is empty
ru_ru: Ресурс API-запроса пуст

source: Request failed. WP_Error: %s - %s
ru_ru: Запрос не выполнен. WP_Error: %s - %s

source: Request failed. %s - %s
ru_ru: Запрос не прошёл. %s - %s

source: Response body is not a correct JSON
ru_ru: Тело ответа не является корректным JSON

source: Response is not an array or is empty
ru_ru: Ответ не является массивом или пуст

source: Iiko response contains the error: %s - %s
ru_ru: Ответ Iiko содержит ошибку: %s - %s

source: There is no image for product category %s
ru_ru: Изображение для категории товара %s отсутствует

source: Error while relate product category thumbnail for %s
ru_ru: Ошибка при добавлении изображения категории товара %s

source: No groups to import
ru_ru: Нет групп для импорта

source: No imported groups
ru_ru: Нет импортированных групп

source: Nomenclature cache is empty. Get the nomenclature from iiko again or check import method in the plugin settings
ru_ru: Кэш номенклатуры пуст. Получите номенклатуру из iiko еще раз или проверьте метод импорта в настройках плагина

source: Cannot import product category %s
ru_ru: Невозможно импортировать категорию товаров %s

source: Simple modifier groups cache is empty
ru_ru: Кеш групп модификаторов пуст

source: Dishes cache is empty
ru_ru: Кеш блюд пуст

source: Goods cache is empty
ru_ru: Кеш товаров пуст

source: Services cache is empty
ru_ru: Кеш услуг пуст

source: Modifiers cache is empty
ru_ru: Кэш модификаторов пуст

source: Sizes cache is empty
ru_ru: Кеш размеров пуст

source: Products array is empty
ru_ru: Массив товаров пуст

source: Product information is empty
ru_ru: Информация товара пуста

source: Product category information is empty
ru_ru: Информация категории товаров пуста

source: Product category %s is excluded in iiko
ru_ru: Категория товара %s исключена в iiko

source: Product category %s is a group modifier
ru_ru: Категория товара %s - групповой модификатор

source: Product category %s is deleted in iiko
ru_ru: Категория товаров %s удалена в iiko
