Repository: common-repository/wc-iikocloud
Catalog: languages/wc-iikocloud-*.po
Languages: ru_ru

source: Product category %s does not contain products
ru_ru: Категория товаров %s не содержит товаров

source: Product doesn't have required data
ru_ru: В товаре отсутствуют необходимые данные

source: Product %s is deleted in iiko
ru_ru: Товар %s удален в iiko

source: Modifier
ru_ru: Модификатор

source: Product %s has sizes. Created %s variation(s)
ru_ru: Товар %s имеет размеры. Создано %s вариаций

source: Product %s has modifiers. Created %s variation(s)
ru_ru: Товар %s имеет модификаторы. Создано %s вариаций

source: Modifier %s
ru_ru: Модификатор %s

source: Product %s has modifiers, but modifier %s doesn't have iiko ID or empty
ru_ru: У товара %s есть модификаторы, но модификатор %s не имеет iiko ID или пуст

source: Product %s has sizes and modifiers. Created %s variation(s)
ru_ru: Товар %s имеет размеры и модификаторы. Создано %s вариаций

source: Created %s variation(s) for %s
ru_ru: Создано %s вариаций для %s

source: Size
ru_ru: Размер

source: Product %s doesn't have size SKU
ru_ru: У товара %s нет артикула размера

source: Product %s doesn't have modifier group SKU
ru_ru: У товара %s нет артикула группы модификаторов

source: Product %s doesn't have modifier SKU
ru_ru: У товара %s нет артикула модификатора

source: There is no image for product %s
ru_ru: Изображение для товара %s отсутствует

source: Error while relate product thumbnail for %s
ru_ru: Ошибка при добавлении изображения товара %s

source: Error while relate product image gallery for %s
ru_ru: Ошибка при добавлении изображения галереи товара %s

source: Cannot set chunk #%s with transient of type - %s
ru_ru: Невозможно установить чанк #%s с трансиентом типа - %s

source: Error while getting iiko %s from the cache. Get the nomenclature one more time.
ru_ru: Ошибка при получении %s iiko из кэша. Получите номенклатуру еще раз.

source: %s request failed
ru_ru: %s запрос не прошёл

source: %s empty
ru_ru: %s пусто

source: %s ID is empty
ru_ru: %s ID пуст

source: %s name is empty
ru_ru: %s имя пустое

source: %1$s %2$s %3$s error
ru_ru: %1$s %2$s %3$s ошибка

source: updated
ru_ru: обновлено

source: inserted
ru_ru: Добавлен(ы)

source: %1$s %2$s has been successfully %3$s (ID: %4$d)
ru_ru: %1$s %2$s был успешно %3$s (ID: %4$d)

source: Product %s: SKU %s is not unique
ru_ru: Товар %s: Артикул %s не уникален

source: %1sIikoCloud Control Panel v%2s%3s
ru_ru: %1sПанель управления iikoCloud v%2s%3s

source: %sExporting orders to the kitchen from tables%s
ru_ru: %sЭкспорт заказов на кухню со столиков%s

source: %sUpdating order statuses from iiko on the website%s
ru_ru: %sОбновление статусов заказов из iiko на сайте%s

source: %sAdvanced import of dishes%s - with sizes and group modifiers
ru_ru: %sПродвинутый импорт блюд%s - с размерами и групповыми модификаторами

source: %sSimultaneous export of delivery orders and kitchen orders%s
ru_ru: %sОдновременный экспорт доставочных заказов и заказов на кухню%s

source: %sSupport for a bonus system%s - a fixed percentage discount on an order
ru_ru: %sПоддержка бонусной системы%s в виде фиксированного процента скидки на заказ

source: %sLinking WooCommerce payment methods used on the site to iiko payment types%s
ru_ru: %sПривязка используемых на сайте методов оплаты WooCommerce к типам оплаты iiko%s

source: %sAuto-import of items%s according to schedule after a specified period of time
ru_ru: %sАвтоимпорт номенклатуры%s по расписанию через заданный промежуток времени

source: %sUpdating iiko stop lists%s - instant removal from sale of goods added to the iiko stop list
ru_ru: %sОбновление стоп-листов iiko%s - мгновенное снятие с продажи товаров добавленных в iiko в стоп-лист

source: %sFlexible customization of the ordering page%s - additional fields: guests, time, entrance, floor and many others
ru_ru: %sГибкая настройка страницы оформления заказа%s - дополнительные поля: гости, время, подъезд, этаж и многие другие

source: %sDelivery zones on Yandex.Map%s when placing an order. Linking Shipping Zones to WooCommerce Shipping Methods
ru_ru: %sЗоны доставки на Яндекс.Карте%s при оформлении заказа. Привязка зон доставки к методам доставки WooCommerce

source: %sTwo new delivery methods: pickup and free delivery%s - for manually selecting the terminal to which to send the order
ru_ru: %sДва новых метода доставки: самовывоз и бесплатная доставка%s - для ручного выбора терминала на который отправлять заказ

source: %sAccess to the latest updates for the regular and premium versions of the plugin%s (the free version on WordPress.org is updated once a year)
ru_ru: %sДоступ к актуальным обновлениям обычной и премиум-версии плагина%s (бесплатная версия на WordPress.org обновляется раз в год)

source: Renew iikoCloud for WooCommerce Premium
ru_ru: Обновить до iikoCloud для WooCommerce Premium

source: Get iikoCloud for WooCommerce Premium
ru_ru: Получите iikoCloud для WooCommerce Premium

source: %sSettings%s
ru_ru: %sНастройки%s

source: %sLogs%s
ru_ru: %sЛоги%s

source: %sPlugin Website%s
ru_ru: %sСайт плагина%s

source: %sDocumentation%s
ru_ru: %sДокументация%s

source: %sSupport%s
ru_ru: %sПоддержка%s

source: Get
ru_ru: Получить

source: Save
ru_ru: Сохранить

# Action
source: Import
ru_ru: Импортировать

source: Update
ru_ru: Обновить

source: Delete
ru_ru: Удалить

source: Use %smouse or CTRL + click%s to select several values in the list.
ru_ru: Используйте %sмышь или CTRL + щелчок мышью%s, чтобы выбрать несколько значений в списке.

source: Nomenclature general info:
ru_ru: Основная информация номенклатуры:

source: Product categories
ru_ru: Категории товаров

source: Products
ru_ru: Товары

source: Dishes
ru_ru: Блюда

source: Goods
ru_ru: Товары

source: Services
ru_ru: Услуги

source: Sizes
ru_ru: Размеры

source: Revision:
ru_ru: Ревизия:

source: Imported nomenclature info:
ru_ru: Информация об импортированной номенклатуре:
